<template>
  <div>
<div id="texthead">
<h2 >บทความของเรา</h2></div>

<div class=" text-align: center " >
      <v-layout row wrap id="Sdiv">
        <v-flex my-2 mx-2 v-for="datail in datails" :key="datail.Id"  >
          <div  falt class="container  text-xs-center " > 
              <v-responesive class="pt-2" >
                    <img height="250" width="440" :src="datail.src" />
              </v-responesive>
              <v-card-text id="divtext">
                  <h5 class=""  >
                      {{datail.detail}}
                  </h5>
              </v-card-text>
             
          </div>
         
        </v-flex>
      </v-layout>
    </div>
    
  </div>
</template>


<style >
#texthead{
    margin-top: 5%;
    margin-right: 2%;
    margin-left: 2%;
}
#img{
width: 25%;
}
#Sdiv{
 margin-top: 5%;
    margin-right: 1%;
    margin-left: 1%;
    margin-bottom: 5%;
}
#divtext{
    width: 350px;
    margin-top: 5%;
    
}
#Stext{
    size: 300
}
</style>


<script>
export default {
  name: "Article",
  props: {
    msg: String,
  },
  data (){
      return{
          datails:[
              {Id:0, src:require("../assets/1 (1).png"), detail:"เลคเชอร์คาสิโนบอยคอตต์แชมเปี้ยน ต้าอ่วยแชมพู ลิมิตบุญคุณนางแบบ สวีทป๋ามอลล์วิลล์ ยนตรกรรมซูโม่วิป สไตล์เอ็นทรานซ์เวิร์ลด์ คอนโทรลซัพพลายเออร์ เทอร์โบแชเชือนสี่แยกหม่านโถวเพียบแปร้ ซัพพลายเออร์หลวงตาสัมนา ซี้วาไรตี้ สะเด่าตอกย้ำสะบึมส์วิทย์ละติน หน่อมแน้ม มิลค์ โปรโมท ติ๋มเนิร์สเซอรี รากหญ้า﻿กรรมาชนคองเกรสสัมนามาร์ตคอนแท็ค ซี้อ่วมคีตกวีวัจนะ ตุ๊ก ซี้ "},
              {Id:1, src: require ("../assets/1 (2).png"), detail:"เลคเชอร์คาสิโนบอยคอตต์แชมเปี้ยน ต้าอ่วยแชมพู ลิมิตบุญคุณนางแบบ สวีทป๋ามอลล์วิลล์ ยนตรกรรมซูโม่วิป สไตล์เอ็นทรานซ์เวิร์ลด์ คอนโทรลซัพพลายเออร์ เทอร์โบแชเชือนสี่แยกหม่านโถวเพียบแปร้ ซัพพลายเออร์หลวงตาสัมนา ซี้วาไรตี้ สะเด่าตอกย้ำสะบึมส์วิทย์ละติน หน่อมแน้ม มิลค์ โปรโมท ติ๋มเนิร์สเซอรี รากหญ้า﻿กรรมาชนคองเกรสสัมนามาร์ตคอนแท็ค ซี้อ่วมคีตกวีวัจนะ ตุ๊ก ซี้ "},
              {Id:2, src:require("../assets/1 (3).png"), detail:"เลคเชอร์คาสิโนบอยคอตต์แชมเปี้ยน ต้าอ่วยแชมพู ลิมิตบุญคุณนางแบบ สวีทป๋ามอลล์วิลล์ ยนตรกรรมซูโม่วิป สไตล์เอ็นทรานซ์เวิร์ลด์ คอนโทรลซัพพลายเออร์ เทอร์โบแชเชือนสี่แยกหม่านโถวเพียบแปร้ ซัพพลายเออร์หลวงตาสัมนา ซี้วาไรตี้ สะเด่าตอกย้ำสะบึมส์วิทย์ละติน หน่อมแน้ม มิลค์ โปรโมท ติ๋มเนิร์สเซอรี รากหญ้า﻿กรรมาชนคองเกรสสัมนามาร์ตคอนแท็ค ซี้อ่วมคีตกวีวัจนะ ตุ๊ก ซี้ "},
          ]
      }
  }
};
</script>

